taurus/taurus.yml
modules:
  jmeter:
    gui: false
    properties:
      global_pause_deviation : 100
      micro_pause_deviation : 100
      short_pause_deviation : 500
      normal_pause_deviation : 5000
      long_pause_deviation : 10000
      longer_pause_deviation : 15000
      server_url : "${server_url}"
      authorisation_url : "${authorisation_url}"
      users_csv : jmeter/Representative/user_data.csv
      competitions_csv : jmeter/Representative/competition_data.csv
      invites_csv : jmeter/Representative/invite_data.csv
      assessor_csv : jmeter/Representative/assessor_data.csv
      front_door_competitions_csv : jmeter/Representative/front-door-competitions.csv
      summariser.name : summary
      summariser.interval : 5
      summariser.log : true
      summariser.out : true

execution:
- iterations: 1
  concurrency: "${invite_users}"
  scenario:
    script: taurus/invite.jmx
- iterations: 1
  concurrency: "${applicant_users}"
  scenario:
    script: taurus/applicant.jmx
- iterations: 1
  concurrency: "${registration_users}"
  scenario:
    script: taurus/registration.jmx
- iterations: 1
  concurrency: "${front_door_users}"
  scenario:
    script: taurus/front_door.jmx
- iterations: 1
  concurrency: "${comp_management_users}"
  scenario:
    script: taurus/competition_management.jmx
- iterations: 1
  concurrency: "${assessor_users}"
  scenario:
    script: taurus/assessor.jmx

reporting:
- module: passfail
  criteria:
  - "fail>50% for 10s, stop as failed"