taurus/taurus.yml
provisioning: "${provisioning}"

modules:
  jmeter:
    gui: false
    properties:
      global_pause_deviation : 100
      micro_pause_deviation : 100
      short_pause_deviation : 500
      normal_pause_deviation : 5000
      long_pause_deviation : 10000
      longer_pause_deviation : 15000
      server_url : "${server_url}"
      authorisation_url : "${authorisation_url}"
      users_csv : "${data_path}user_data.csv"
      competitions_csv : "${data_path}competition_data.csv"
      invites_csv : "${data_path}invite_data.csv"
      assessor_csv : "${data_path}assessor_data.csv"
      front_door_competitions_csv : "${data_path}front-door-competitions.csv"
      summariser.name : summary
      summariser.interval : 5
      summariser.log : true
      summariser.out : true

  cloud:
    test: High load test

execution:
- scenario: invite_users
  iterations: 1
  locations:
    eu-west-2: 1
    europe-west2-a: 1
  concurrency: "${invite_users}"
  files:
  - jmeter/Representative/invite_data.csv

- scenario: applicant_users
  iterations: 1
  locations:
    eu-west-2: 1
    europe-west2-a: 1
  concurrency: "${applicant_users}"
  files:
  - jmeter/Representative/user_data.csv

- scenario: registration_users
  iterations: 1
  locations:
    eu-west-2: 1
    europe-west2-a: 1
  concurrency: "${registration_users}"
  files:
  - jmeter/Representative/competition_data.csv

- scenario: front_door_users
  iterations: 1
  locations:
    eu-west-2: 1
    europe-west2-a: 1
  concurrency: "${front_door_users}"
  files:
  - jmeter/Representative/front-door-competitions.csv

- scenario: competition_management
  iterations: 1
  locations:
    eu-west-2: 1
    europe-west2-a: 1
  concurrency: "${comp_management_users}"

- scenario: assessor_users
  iterations: 1
  locations:
    eu-west-2: 1
    europe-west2-a: 1
  concurrency: "${assessor_users}"
  files:
  - jmeter/Representative/assessor_data.csv

scenarios:
  invite_users:
    script: taurus/invite.jmx
  applicant_users:
    script: taurus/applicant.jmx
  registration_users:
    script: taurus/registration.jmx
  front_door_users:
    script: taurus/front_door.jmx
  competition_management:
    script: taurus/competition_management.jmx
  assessor_users:
    script: taurus/assessor.jmx

reporting:
- module: passfail
  criteria:
  - "fail>50% for 10s, stop as failed"